In [1]:
import pandas as pd

In [14]:
a = {'col0':[2,3,4,5],'col1':[3,4,5,3]}

In [15]:
a

{'col0': [2, 3, 4, 5], 'col1': [3, 4, 5, 3]}

In [16]:
type(a)

dict

In [17]:
a

{'col0': [2, 3, 4, 5], 'col1': [3, 4, 5, 3]}

In [18]:
df = pd.DataFrame.from_dict(a)

In [19]:
df

   col0  col1
0     2     3
1     3     4
2     4     5
3     5     3

## Operations on DataFrame

In [24]:
# Slicing

In [25]:
print(df.head(2))

   col0  col1
0     2     3
1     3     4

In [26]:
print(df.tail(2))

   col0  col1
2     4     5
3     5     3

In [28]:
# Merging

In [29]:
df1 = pd.DataFrame({"HPI":[38,34,43,23],"Int_rate":[2,3,2,3],
                   "IND_GDP":[50,45,45,67]},index = [2001,2002,2003,2004])

In [30]:
df1

      HPI  Int_rate  IND_GDP
2001   38         2       50
2002   34         3       45
2003   43         2       45
2004   23         3       67

In [31]:
df2 = pd.DataFrame({"HPI":[38,34,43,23],"Int_rate":[2,3,2,3],
                   "IND_GDP":[50,45,45,67]},index = [2005,2006,2007,2008])

In [32]:
df2

      HPI  Int_rate  IND_GDP
2005   38         2       50
2006   34         3       45
2007   43         2       45
2008   23         3       67

In [33]:
merge = pd.merge(df1,df2)

In [34]:
merge

   HPI  Int_rate  IND_GDP
0   38         2       50
1   34         3       45
2   43         2       45
3   23         3       67

In [35]:
# if want particular column common then:

In [37]:
merge = pd.merge(df1,df2,on="HPI")

In [38]:
merge

   HPI  Int_rate_x  IND_GDP_x  Int_rate_y  IND_GDP_y
0   38           2         50           2         50
1   34           3         45           3         45
2   43           2         45           2         45
3   23           3         67           3         67

In [39]:
# Joining

In [45]:
df1 = pd.DataFrame({"INT_rate":[2,1,2,3],
                   "IND_GDP":[50,45,45,67]},index = [2001,2002,2003,2004])
df2 = pd.DataFrame({" Low_Tier_HPI ":[50,45,67,34],
                   "Unemployment":[1,2,5,6]},index = [2001,2002,2003,2004])

join = df1.join(df2)

In [46]:
join

      INT_rate  IND_GDP   Low_Tier_HPI   Unemployment
2001         2       50              50             1
2002         1       45              45             2
2003         2       45              67             5
2004         3       67              34             6

In [47]:
# Changing the Index and Column Headers:

In [76]:
d = {"First":[1,2,3,4],
    "Second":[3,4,3,2],
    "Third":[5,6,4,3]}

In [77]:
d

{'First': [1, 2, 3, 4], 'Second': [3, 4, 3, 2], 'Third': [5, 6, 4, 3]}

In [78]:
type(d)

dict

In [79]:
dafr = pd.DataFrame.from_dict(d)

In [80]:
dafr

   First  Second  Third
0      1       3      5
1      2       4      6
2      3       3      4
3      4       2      3

In [81]:
dafr.set_index('First',inplace=True)

In [82]:
dafr

       Second  Third
First
1           3      5
2           4      6
3           3      4
4           2      3

In [91]:
dafr = dafr.rename(columns={"Second":"First","Third":"Second"})

In [92]:
dafr

       First  Second
First
1          3       5
2          4       6
3          3       4
4          2       3

In [93]:
# Concatenation

In [100]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[5,6,4]})
df2 = pd.DataFrame({'A':[4,5,6],'D':[5,2,3]})

In [101]:
df1

   A  B
0  1  5
1  2  6
2  3  4

In [102]:
df2

   A  D
0  4  5
1  5  2
2  6  3

In [103]:
co = pd.concat([df1,df2])

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [104]:
co

   A    B    D
0  1  5.0  NaN
1  2  6.0  NaN
2  3  4.0  NaN
0  4  NaN  5.0
1  5  NaN  2.0
2  6  NaN  3.0

In [114]:
# Data Munging (Convert DataFrame to another DataFrame)

In [115]:
USA_house_price = pd.read_csv("USA_Housing.csv")

In [116]:
USA_house_price.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386

In [117]:
USA_house_price.to_html('price.html')

# That's how pandas library works.